import React from 'react';

const History = () => {
    return (
        <div>
            <p>Основная статья: История вычислительной техники

3000 лет до н. э. — в Древнем Вавилоне были изобретены первые счёты — абак.
500 лет до н. э. — в Китае появился более «современный» вариант абака с косточками на соломинках — суаньпань.
87 год до н. э. — в Греции был изготовлен «антикитерский механизм» — механическое устройство на базе зубчатых передач, представляющее собой специализированный астрономический вычислитель.
В XIII веке Луллий Раймунд создал логическую машину в виде бумажных кругов, построенных по троичной логике.
1492 год — Леонардо да Винчи в одном из своих дневников приводит эскиз 13-разрядного суммирующего устройства с десятизубцовыми кольцами. Хотя работающее устройство на базе этих чертежей было построено только в XX веке, всё же реальность проекта Леонардо да Винчи подтвердилась.

Суммирующая машина Паскаля

XVI век — в России появились счёты, в которых было 10 деревянных шариков на проволоке.
1623 год — Вильгельм Шиккард, профессор университета Тюбингена, разрабатывает устройство на основе зубчатых колес («считающие часы») для сложения и вычитания шестиразрядных десятичных чисел. Было ли устройство реализовано при жизни изобретателя, достоверно не известно, но в 1960 году оно было воссоздано и проявило себя вполне работоспособным.
1630 год — Уильям Отред и Ричард Деламейн создают круговую и прямоугольную логарифмические линейки.
1642 год — Блез Паскаль представляет «Паскалину» — первое реально осуществлённое и получившее известность механическое цифровое вычислительное устройство. Прототип устройства суммировал и вычитал пятиразрядные десятичные числа. Паскаль изготовил более десяти таких вычислителей, причём последние модели оперировали числами с восемью десятичными разрядами.
1673 год — известный немецкий философ и математик Готфрид Вильгельм Лейбниц построил арифмометр, который выполнял умножение, деление, сложение и вычитание. Позже Лейбниц описал двоичную систему счисления и обнаружил, что если записывать определённые группы двоичных чисел одно под другим, то нули и единицы в вертикальных столбцах будут регулярно повторяться, и это открытие навело его на мысль, что существуют совершенно новые законы математики. Лейбниц решил, что двоичный код оптимален для системы механики, которая может работать на основе перемежающихся активных и пассивных простых циклов. Он пытался применить двоичный код в механике и даже сделал чертёж вычислительной машины, работавшей на основе его новой математики, но вскоре понял, что технологические возможности его времени не позволяют создать такую машину[4].
Примерно в это же время Исаак Ньютон закладывает основы математического анализа.
1723 год — немецкий математик и астроном Христиан Людвиг Герстен на основе работ Лейбница создал арифметическую машину. Машина высчитывала частное и число последовательных операций сложения при умножении чисел. Кроме того, в ней была предусмотрена возможность контроля за правильностью ввода данных.
1786 год — немецкий военный инженер Иоганн Мюллер в ходе работ по усовершенствованию механического калькулятора на ступенчатых валиках Лейбница, придуманного его соотечественником Филиппом Хахном[5], выдвигает идею «разностной машины» — специализированного арифмометра для табулирования логарифмов, вычисляемых разностным методом.
1801 год — Жозеф Мари Жаккар строит ткацкий станок с программным управлением, программа работы которого задаётся с помощью комплекта перфокарт.
1820 год — первый промышленный выпуск арифмометров. Первенство принадлежит французу Тома де Кальмару.
1822 год — английский математик Чарльз Бэббидж изобрёл, но не смог построить, первую разностную машину (специализированный арифмометр для автоматического построения математических таблиц) (см.: Разностная машина Чарльза Бэббиджа).
1840 год — Томас Фаулер (англ. Great Torrington) построил деревянную троичную счётную машину с троичной симметричной системой счисления[6][7].
1855 год — братья Георг и Эдвард Шутц (англ. George & Edvard Scheutz) из Стокгольма построили первую разностную машину на основе работ Чарльза Бэббиджа.
1876 год — русским математиком П. Л. Чебышёвым создан суммирующий аппарат с непрерывной передачей десятков. В 1881 году он же сконструировал к нему приставку для умножения и деления (арифмометр Чебышёва).
1884—1887 годы — Холлерит разработал электрическую табулирующую систему, которая использовалась в переписях населения США 1890 и 1900 годов и Российской империи в 1897 году.
1912 год — создана машина для интегрирования обыкновенных дифференциальных уравнений по проекту русского учёного А. Н. Крылова.

Зал счётных машин «Computing Division» Казначейства США. 1920-е

1927 год — в Массачусетском технологическом институте (MIT) Вэниваром Бушем был разработан механический аналоговый компьютер[8].
1938 год — немецкий инженер Конрад Цузе вскоре после окончания в 1935 году Берлинского политехнического института построил свою первую машину, названную Z1. (В качестве его соавтора упоминается также Гельмут Шрейер (нем. Helmut Schreyer)). Это полностью механическая программируемая цифровая машина. Модель была пробной и в практической работе не использовалась. Её восстановленная версия хранится в Немецком техническом музее в Берлине. В том же году Цузе приступил к созданию машины Z2 (Сначала эти компьютеры назывались V1 и V2. По немецки это звучит «Фау1» и «Фау2» и чтобы их не путали с ракетами, компьютеры переименовали в Z1 и Z2).

Компьютер ЭНИАК

1941 год — Конрад Цузе создаёт первую вычислительную машину Z3, обладающую всеми свойствами современного компьютера.
1942 год — в Университете штата Айова Джон Атанасов и его аспирант Клиффорд Берри (англ. Clifford Berry) создали (а точнее — разработали и начали монтировать) первый в США электронный цифровой компьютер ABC. Хотя эта машина так и не была завершена (Атанасов ушёл в действующую армию), она, как пишут историки, оказала большое влияние на Джона Мокли, создавшего двумя годами позже ЭВМ ЭНИАК.
Конец 1943 года — заработала британская вычислительная машина специального назначения Colossus. Машина работала над расшифровкой секретных кодов фашистской Германии.
Февраль 1944 года — группой американских инженеров под руководством Говарда Эйкена закончена разработка первой американской вычислительной машины Марк I. После монтажа, наладки и испытаний она стала использоваться для выполнения сложных баллистических расчётов американского ВМФ.
1944 год — Конрад Цузе разработал ещё более быстрый компьютер Z4, а также первый язык программирования высокого уровня Планкалкюль.
1946 год — публике представлена первая универсальная электронная цифровая вычислительная машина ЭНИАК, разрабатывавшаяся секретно с 1943 года.
4 декабря 1948 года — Государственный комитет Совета министров СССР по внедрению передовой техники в народное хозяйство зарегистрировал за номером 10475 изобретение И. С. Бруком и Б. И. Рамеевым цифровой электронной вычислительной машины.
1950 год — группой Лебедева в Киеве создана первая советская электронная вычислительная машина.
1957 год — американской фирмой NCR создан первый компьютер на транзисторах.
1958 год — Н. П. Брусенцов с группой единомышленников построил первую троичную ЭВМ с позиционной симметричной троичной системой счисления «Сетунь».</p>
        </div>
    );
};

export default History;